// Напишите программу, которая выводит на экран числа от 1 до 100. При этом вместо чисел, кратных трем, программа должна выводить слово Fizz, 
// а вместо чисел, кратных пяти — слово Buzz. Если число кратно пятнадцати, то программа должна выводить слово FizzBuzz. Задача может показаться очевидной, но нужно получить наиболее простое и красивое решение.
for(int ind = 1; ind <= 100; ind++)  
{
    if (ind % 15 == 0)
    {
        Console.Write("FizzBuzz ");
    }
    else if (ind % 3 == 0)
    {
        Console.Write("Fizz ");
    }
    else if (ind % 5 == 0)
    {
        Console.Write("Buzz ");
    }
    else
    {
        Console.Write($"{ind} ");
    }
}






