// Сгенерировать массив случайных целых чисел размерностью m*n (размерность вводим с клавиатуры) , при чем чтоб количество элементов было четное. 
// Вывести на экран красивенько таблицей. Перемешать случайным образом элементы массива, при чем чтобы каждый элемент гарантированно и только один раз переместился на другое место 
// и выполнить перемешивание за m*n / 2 итераций. То есть если массив три на четыре, то надо выполнить за 6 итераций. И далее в конце опять вывести на экран как таблицу.
// НЕ СДЕЛАНО